'''11.Дані дві прямі, задані рівняннями у=k1x+b1 и y=k2x+b2.
Якщо ці прямі паралельні, то визначити відстань між ними.
'''
import math
k1 = float(input('Введіть значення k1: '))
k2 = float(input('Введіть значення k2: '))
b1 = float(input('Введіть значення b1: '))
b2 = float(input('Введіть значення b2: '))

if k1 == k2:
    l = math.fabs(b1 - b2)/math.sqrt(k1**2 + 1)
    print('Прямі паралельні.')
    print('Відстань між прямими: ', '%.2f' %l)
else:
    print('Прямі не є паралельними.')
